System.out.println()
자바 표준 입출력 클래스
사용자가 프로그램과 대화하기 위해서는 사용자와 프로그램 사이의 입출력을 담당하는 수단이 필요합니다.

자바에서는 모든 것이 객체로 표현되므로, 입출력을 담당하는 수단 또한 모두 객체입니다.

 

C언어의 printf() 함수나 scanf() 함수처럼 자바에서는 System이라는 표준 입출력 클래스를 정의하여 제공하고 있습니다.

이러한 System 클래스는 java.lang 패키지에 포함되어 제공됩니다.

System 클래스에는 표준 입출력을 위해 다음과 같은 클래스 변수(static variable)가 정의되어 있습니다.

 

1. System.in

2. System.out

3. System.err

 

자바에서는 System.in 스트림을 사용하여 표준 입력 작업을 수행합니다.

또한, System.out 스트림이나 System.err 스트림을 사용하여 표준 출력 작업을 수행합니다.

 

아직 클래스나 객체, 메소드, 스트림 등에 대해 자세히 배우기 전이지만, 앞으로 배우게 될 대부분의 예제를 이해하기 위해서는 표준 입출력 객체에 대해 먼저 살펴볼 필요가 있습니다.
System.out.println()
System.out.println() 메소드를 사용하면 모니터에 전달된 데이터를 출력한 후에 줄 바꿈까지 해줍니다.

 

println() 메소드를 사용하는 문법은 다음과 같습니다.

문법
System.out.println(출력할데이터);

 

이렇게 표준 출력 스트림에 전달된 데이터는 스트림을 통해 출력 장치로 전달되어 출력됩니다.

 

예제
System.out.print(7);         // print() 메소드는 줄 바꿈을 하지 않음.

System.out.println(3);       // 정수 출력

System.out.println(3.14);    // 실수 출력

System.out.println("자바!"); // 문자열 출력

System.out.println("문자열끼리의 " + "연결도 가능합니다.");

System.out.println("숫자" + 3 + "과 문자열의 연결도 가능합니다.");

코딩연습 ▶

실행 결과
73

3.14

자바!!

문자열끼리의 연결도 가능합니다.

숫자3과 문자열의 연결도 가능합니다.

 

println() 메소드와는 달리 print() 메소드는 전달된 데이터를 출력한 후에 줄 바꿈을 하지 않습니다.