자바 기초
자바란?
자바(Java)는 C언어에 객체 지향적 기능을 추가하여 만든 C++과는 달리, 처음부터 객체 지향 언어로 개발된 프로그래밍 언어입니다.

자바는 자바 가상 머신(JVM, Java Virtual Machine)을 사용하여, 운영체제와는 독립적으로 동작할 수 있습니다

따라서 자바는 어느 운영체제에서나 같은 형태로 실행될 수 있습니다.

바로 이러한 점이 수많은 개발자로 하여금 자바를 사용하게 하는 원동력이 되고 있습니다.

현재 자바는 전 세계에서 가장 많이 사용하는 프로그래밍 언어 중 하나입니다.

자바의 역사
처음에 자바는 가전제품 내에서 동작하는 임베디드 프로그램을 위한 언어로 썬 마이크로시스템즈(Sun Microsystems)사의 제임스 고슬링(James Gosling) 팀에 의해 개발되었습니다.

1991년에 오크(Oak)라는 이름으로 시작하여, 1996년에 발표된 1.0.2 버전부터 자바(Java)라는 이름을 사용하게 됩니다.

1998년 발표된 J2SE 1.2에서는 웹에서도 자바를 돌릴 수 있게 해 주는 자바 애플릿(Java Applet)이 추가되며, 자바의 인기는 급상승하게 됩니다.

그 후 버전이 업데이트될 때마다 다양한 기능이 지원되며 자바는 꾸준한 인기를 누리게 됩니다.

이후 2009년에 썬 마이크로시스템즈사가 오라클과 인수 합병됨에 따라 자바 또한 오라클로 소유권이 넘어갑니다.

자바의 특징
자바 언어가 가지는 장점은 다음과 같습니다.

 

1. 자바는 운영체제와는 독립적으로 실행할 수 있습니다.

2. 자바는 불필요한 기능을 과감히 제거하여 다른 언어에 비해 배우기가 쉽습니다.

3. 자바는 자동 메모리 관리 등을 지원하여 다른 언어에 비해 안정성이 높습니다

4. 자바는 연산자 오버로딩을 금지하고 제네릭을 도입함으로써 코드의 가독성을 높였습니다.

5. 자바에 관한 수많은 참고 자료를 찾을 수 있습니다.

 

자바 언어가 가지는 단점은 다음과 같습니다.

 

1. 자바는 실행을 위해 자바 가상 머신을 거쳐야 하므로, 다른 언어에 비해 실행 속도가 느립니다.

2. 자바는 예외 처리가 잘 되어 있지만, 개발자가 일일이 처리를 지정해 줘야 한다는 불편함이 있습니다.

3. 자바는 다른 언어에 비해 작성해야 하는 코드의 길이가 긴 편입니다.

자바 표준
썬 마이크로시스템즈사는 1997년에 ISO/IEC에서 표준화 절차를 밟았으나 성사되지 못합니다.

이후 자바는 자발적 표준(de facto)으로써 자바 커뮤니티 프로세스(Java Community Process)를 통해 관리됩니다.

2007년에 썬 마이크로시스템즈사는 자바의 코어 부분을 대부분 GPL 라이선스로 오픈합니다.

이후 2009년에 썬 마이크로시스템즈사가 오라클과 인수 합병됨에 따라 자바에 대한 권리 및 유지보수 또한 현재는 오라클에서 수행하고 있습니다.

 

자바의 버전은 보통 JDK 또는 Java SE 버전으로 나타냅니다.

초기 버전인 1.0/1.1 버전에서는 JDK(Java Development Kit)를 사용했지만, JDK 1.2를 발표하면서 J2SE로 변경합니다.

J2SE(Java2 Standard Edition)라는 명칭 또한, 2006년 JDK 1.6부터 Java SE(Java Standard Edition)로 변경됩니다.

가장 최신 버전의 자바는 2014년에 발표된 Java SE 8 버전입니다.

현재에는 2017년 제정을 목표로 하는 Java SE 9 버전 제정과 관련된 논의가 계속 진행되고 있습니다.

 

자바 최신 표준인 Java SE 8에 대한 더 자세한 사항은 다음 페이지를 참고하면 됩니다.

 

The Java™ Language Specification : Java SE 8 Edition => https://docs.oracle.com/javase/specs/jls/se8/html/index.html